---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.CutLineWeight
source: html/f06ecb22-3800-6078-e437-eb9ffe32f7c7.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.CutLineWeight Property

Cut surface line weight.

## Syntax (C#)
```csharp
public int CutLineWeight { get; }
```